function componentStrategyGuide() {
    // 返回值会暴露给模板和其他的选项式 API 钩子
    return {
        // 资源兑换
        resourceExchange: buildResourceExchange(),
        // 阵法介绍
        heroTactical: buildHeroTactical(),
        // Boss攻防数据
        heroBoss: buildHeroBoss(),
    }
}

/**
 * 资源兑换
 */
function buildResourceExchange() {
    const arr = [
        '<ul style="font-size: 16px;">',
        `<li><p style="color: #f00;">千虫丝</p>
            <p>史家庄丁：柳虫皮x3,大柳虫皮x2,青蛇皮x1</p>
        </li>`,
        `<li><p style="color: #f00;">万虫羹[绑定]</p>
            <p>赵老三：柳虫皮x4、大柳虫皮x3、青蛇皮x2、青蛇胆x1</p>
        </li>`,
        `<li><p style="color: #f00;">高级万虫羹[绑定]</p>
            <p>赵老三：柳虫皮x8、大柳虫皮x6、青蛇皮x4、青蛇胆x2</p>
        </li>`,
        `<li><p style="color: #f00;">金刚罩一</p>
            <p>钓叟：蜂王浆x10,龙皮x3,老龟壳x1,银两x10000</p>
        </li>`,
        `<li><p style="color: #f00;">金刚罩二</p>
            <p>钓叟：蜂王浆x40,龙皮x12,老龟壳x4,银两x40000</p>
        </li>`,
        `<li><p style="color: #f00;">强体奇书</p>
            <p>黑风岭砍柴老者：千虫丝x6,虎骨x2,黄金虎骨x2</p>
        </li>`,
        `<li><p style="color: #f00;">强体奇书三</p>
            <p>红须老者：六艺授权令x10、蜥蜴王内丹x5、红岩鲤鱼王鱼鳞x5、吸血螳螂血x20</p>
            <p>使用条件：120级以上</p>
        </li>`,
        `<li><p style="color: #f00;">金刚奇书</p>
            <p>游方和尚：变异菜青虫毒液x4,太尉秘图x2</p>
        </li>`,
        `<li><p style="color: #f00;">血印金刚奇书</p>
            <p>游方和尚：金刚奇书x1,血印秘籍x1</p>
        </li>`,
        `<li><p style="color: #f00;">狂暴奇书</p>
            <p>武松：蒙汗药x30、景阳岗虎皮x16、冰魄珠x2</p>
        </li>`,
        `<li><p style="color: #f00;">狂暴二</p>
            <p>武松：蒙汗药x50,景阳岗虎皮x30,冰魄珠x5</p>
        </li>`,
        `<li><p style="color: #f00;">统帅奇书</p>
            <p>白光老人：蟒蛇皮x20、蟒蛇胆x10、蜥蜴王内丹x5、红岩鲤鱼王鱼鳞x5、冰雪巨熊掌x10、冰雪大巨熊掌x5</p>
            <p>使用条件：120级以上</p>
        </li>`,
        `<li><p style="color: #f00;">龙灵仙凤丹</p>
            <p>红发侏儒：10个仙灵丹碎屑可兑换1个龙灵仙凤丹</p>
        </li>`,
        `<li><p style="color: #f00;">战神丸(绑)</p>
            <p>无极真人：圣兽符x10,星宿符x50,八卦符x20,四象符x10</p>
            <p>使用条件：120级以上</p>
        </li>`,
        `<li><p style="color: #f00;">上古神兵训练术</p>
            <p>无极真人：圣兽符x40,星宿符x200,八卦符x80,四象符x40,五星七曜八卦阵牌x10</p>
            <p>使用条件：仙兵120级以上</p>
        </li>`,
        `<li><p style="color: #f00;">麒麟网</p>
            <p>红须老者：岩灰x6、蓝岩灰x6、火岩灰x6、火蚁翼x20、火蜂刺x10</p>
        </li>`,
        `<li><p style="color: #f00;">八阵图-黄泥岗</p>
            <p>云：右上左左左左下</p>
            <p>地：右下下下下下下</p>
            <p>天：右上上上上上上</p>
            <p>虎：右下下右右右右</p>
            <p>蛇：右下右下右下右</p>
            <p>风：右下右右上上右</p>
            <p>鸟：右右右右下右右</p>
            <p>龙：右上上右右右右</p>
        </li>`,
        `<li><p style="color: #f00;">连升多级</p>
            <p>1～100：需要花费 粮草x68470892 木材x68470892 石料x68470892 生铁x68470892 潜能x807573552</p>
            <p>1～120：需要花费 粮草x159154552 木材x159154552 石料x159154552 生铁x159154552 潜能x4595612690</p>
            <p>1～150：需要花费 粮草x410981291 木材x410981291 石料x410981291 生铁x410981291 银两x55305500 潜能x21078126914</p>
        </li>`,
        '</ul>',
    ]
    return arr.join('')
}

/**
 * 阵法介绍
 */
function buildHeroTactical() {
    const arr = [
        '<ul style="font-size: 16px;">',
        `<li><p style="color: #f00;">阵法介绍</p>
            <p>对立方相克：金克木,木克土,土克水,水克火,火克金；</p>
            <p>同一方相生：木生火,火生土,土生金,金生水,水生木</p>
            <p>
            学习阵法的前提，必须有相关的兵种，如要学习长蛇阵，那么武将需要有冲锋枪兵、神行棍兵、仙兵、禁军侍卫4个兵种才能学习该阵法，其他阵法需要的兵种请参考下面列举到得兵种
            每个阵法都有五行属性，对立方相克：金克木,木克土,土克水,水克火,火克金；同一方相生：木生火,火生土,土生金,金生水,水生木
            在战场中，同一方军队使用阵法技能起相生作用，即只会有伤害增幅。如：
            </p>
            <p>
            1、攻方军队a（武将学习了水属性阵法技能），军队b（武将学习了金属性阵法技能），军队b的4个兵种的等级都是100级，兵种的金攻性都是100。守方有军队e，武将和兵种的水抗性为0。
            因为金生水，因此在成功使用了阵法技能后，军队a攻击军队e的武将和兵种造成的伤害可达到1.8倍。同方多个军队可对一个军队相生，如攻方在战斗中再加入两个学习了金属性阵法的武将（其所带的兵种等级是100级，金攻性为100）进入战场，并且都成功使用了阵法技能，那么a军队攻击e军队的武将和兵种造成的伤害可达到1.8*1.8*1.8=5.832。
            </p>
            <p>
            2、攻方有军队a（武将学习了金属性阵法），a的4个兵种的等级都是100级，金攻性都是100。守方有军队e（木），金抗性为0。
            因为金克木，因此在成功使用了阵法技能后，军队a攻击军队e的武将和兵种造成的伤害是2倍，当然，如果e军队撤销了阵法技能，将会只有1倍伤害而已
            玩家只需要根据的自身兵种情况学习相应的阵法，这样在战斗中可能能扭转乾坤
            </p>
            <p>长蛇阵（金）：冲锋枪兵、神行棍兵、仙兵、禁军侍卫</p>
            <p>斗底阵（木）：乱棍军、铁甲枪兵、敢死兵、赤甲斧头兵</p>
            <p>三才阵（土）：刀斧手、长臂刀兵、羽林刀客、御林剑客</p>
            <p>出水阵（水）：刺枪兵、步兵、乱剑手、重锤手</p>
            <p>群羊阵（火）：快剑手、步兵、骑兵、金刚棍兵</p>
            <p>北斗阵（金）：快刀手、重剑手、军斧兵、黄金枪兵</p>
            <p>金锁阵（火）：大力刀手、大力棍手、飞剑手、重甲枪兵</p>
            <p>星观阵（土）：金甲女兵、木偶兵、千剑娘子军、神刀兵</p>
            <p>埋伏阵（水）：水兵、狂暴步兵、飞刀手、陆行军</p>
            <p>沧州广场的阵法大师可进入9个阵法副本，有实力的玩家可以去挑战，该副本最后boss有几率掉落星光装备、五行碎片、黑丹砂、阵法技能书</p>
        </li>`,
        '</ul>',
    ]
    return arr.join('')
}

/**
 * Boss攻防数据
 */
function buildHeroBoss() {
    const arr = [
        '<ul style="font-size: 16px;">',
        `<li><p style="color: #f00;">九头巨龙</p>
            <p>生命:80000000/80000000</p>
            <p>攻击力:43000</p>
            <p>防御力:4000</p>
        </li>`,
        `<li><p style="color: #f00;">婆.叶比亚</p>
            <p>生命:32000000/32000000</p>
            <p>攻击力:43030</p>
            <p>防御力:644696</p>
        </li>`,
        `<li><p style="color: #f00;">叶一城</p>
            <p>生命:300000000/300000000</p>
            <p>攻击力:67050</p>
            <p>防御力:4630</p>
        </li>`,
        `<li><p style="color: #f00;">沂岭猛虎</p>
            <p>生命:8000000/8000000</p>
            <p>攻击力:303600</p>
            <p>防御力:2124800</p>
        </li>`,
        `<li><p style="color: #f00;">沂岭幼虎</p>
            <p>生命:4000000/4000000</p>
            <p>攻击力:37950</p>
            <p>防御力:464600</p>
        </li>`,
        '</ul>',
    ]
    return arr.join('')
}
